
; - 2. Использование директив определения данных ( DB, DW, DD,..) для записи инструкций (кодов) программы.

;==================================================================================================
.model tiny										; создание .COM файла
.code				
	ORG 	100h								; начальное смещение файла .COM
Beg:
;==================================================================================================
	jmp 	Start                               ; обойти данные
	enter_msg db 'Hello, World!1$'				; строка для вывода
	
Start:
;==================================================================================================
; Вывод строки на экран
	;push 	offset enter_msg					; кладем в стек параметр для процедуры
	;call 	print_srting	            		; вызов процедуры 
	db 50h                                      ; push ax
	db 55h										; push bp
	dw 0EC8Bh									; mov bp, sp
	df 5D01030246C7h							; mov word ptr [bp + 02], 0103; pop bp
	dw 05E8h									; 
	db 00h                                      ; call 0123
	
;==================================================================================================
;Выход из программы
	;mov 	ax, 4C00h
	;int 	21h
	
	dw 00b8h                                    ;mov 	ax, 4C00h
	db 4Ch                                      ;
	dw 21CDh                                    ;int 	21h
;==================================================================================================
; Выводит строку, смещение в стеке
print_srting proc near
	ARG msg
;==================================================================================================
; Передача параметров через стек
	push 	bp
	mov 	bp, sp								; т.к. сохран-ся адрес возврата, то обращаемся через регистр BP
	
	push 	ax									; сохранение регистров 
	push	dx	
	
	mov 	ah, 09h								; Вывод строки на экран
	mov 	dx, msg							    
	int 	21h									
	
	pop 	dx									; восстановление регистров
	pop 	ax
	
	pop 	bp
	ret 	2									; ret 2*N, где N - кол-во параметров
endp

end Beg
;==================================================================================================